

#  新闻资讯最大出现次数
MAX_COUNT = 6

# 百度标题包含关键字最小值
MIN_COUNT = 5

# 新闻库
NEWS_WAREHOUSE = ['百度文库', '知乎', '搜狗问问', '百度知道','今日头条', '微信公众平台', '北京时间号', '百度百家', '搜狐媒体平台', '搜狐博客', 'QQ空间', '腾讯媒体开放平台',
                          '网易媒体开放平台', '网易云阅读', '网易博客', '新浪微博', '新浪看点', '新浪博客', '凤凰自媒体', '凤凰博客', '亿欧专栏', '一点资讯', '钛媒体', '虎嗅网',
                          'I黑马专栏', '新芽专栏', '速途专栏', '砍柴网专栏', 'A5专栏', '站长专栏', '艾瑞专栏', '亿邦动力专栏', '价值中国专栏', '知乎专栏', '阿里巴巴专栏',
                          '财富中文网专栏', '创业邦专栏', '天涯博客', '和讯博客', 'TechWeb博客', '中金博客', '博客中国', '企博网', '飞象博客', '光明网博客', '派代网', '豆瓣网',
                          '人人小站', 'UC订阅号', '简书', '红网新闻频道', '荆楚网', '界面', '东方财富博客', '知乎', '请检查您输入的关键词是否有错误', '搜狗百科', '人民网', '中国网',
                          '央视网新闻频道', '新浪网', '搜狐网', '中国新闻网', '中国政府网', '百度百科', '网易新闻', '中新网', '光明网', '央广网', '百度百聘', '网易出品', '千龙网',
                          '汉网', '上海热线侬好频道', '中国广播网', '网易汽车', '青岛新闻网', '国际在线', '新华网', '央广网吉林频道', '凤凰网', '腾讯网', '上海热线娱乐频道', '大众网',
                          '东北网', '华龙网', '中国青年网', '绵阳频道']